In [1]:
import sqlite3 
import pandas as pd
connection = sqlite3.connect('database.sqlite')
print("Database opened successfully")

Database opened successfully

In [2]:
tables = pd.read_sql("SELECT * FROM sqlite_master WHERE type='table';", connection)
print(tables)

    type               name           tbl_name  rootpage  \
0  table    sqlite_sequence    sqlite_sequence         4
1  table  Player_Attributes  Player_Attributes        11
2  table             Player             Player        14
3  table              Match              Match        18
4  table             League             League        24
5  table            Country            Country        26
6  table               Team               Team        29
7  table    Team_Attributes    Team_Attributes         2

                                                 sql
0             CREATE TABLE sqlite_sequence(name,seq)
1  CREATE TABLE "Player_Attributes" (\n\t`id`\tIN...
2  CREATE TABLE `Player` (\n\t`id`\tINTEGER PRIMA...
3  CREATE TABLE `Match` (\n\t`id`\tINTEGER PRIMAR...
4  CREATE TABLE `League` (\n\t`id`\tINTEGER PRIMA...
5  CREATE TABLE `Country` (\n\t`id`\tINTEGER PRIM...
6  CREATE TABLE "Team" (\n\t`id`\tINTEGER PRIMARY...
7  CREATE TABLE `Team_Attributes` (\n\t`id`\tINTE...

In [3]:
countries = pd.read_sql("SELECT * FROM Country;", connection)

In [4]:
countries.head()

      id     name
0      1  Belgium
1   1729  England
2   4769   France
3   7809  Germany
4  10257    Italy

In [5]:
players = pd.read_sql_query("SELECT * FROM Player", connection)
players.head()

,id,player_api_id,player_name,player_fifa_api_id,birthday,height,weight
0,1,505942,Aaron Appindangoye,218353,1992-02-29 00:00:00,182.88,187
1,2,155782,Aaron Cresswell,189615,1989-12-15 00:00:00,170.18,146
2,3,162549,Aaron Doran,186170,1991-05-13 00:00:00,170.18,163
3,4,30572,Aaron Galindo,140161,1982-05-08 00:00:00,182.88,198
4,5,23780,Aaron Hughes,17725,1979-11-08 00:00:00,182.88,154

In [6]:
selected_players = pd.read_sql_query("SELECT * FROM Player WHERE height >= 180 AND weight >= 170 ", connection)
print(selected_players)

         id  player_api_id            player_name  player_fifa_api_id  \
0         1         505942     Aaron Appindangoye              218353
1         4          30572          Aaron Galindo              140161
2         9         528212           Aaron Lennox              206592
3        11          23889          Aaron Mokoena               47189
4        17         161644  Aaron Taylor-Sinclair              213569
5        20          46447              Abasse Ba              156626
6        24          42664     Abdelkader Ghezzal              178063
7        29         306735    Abdelouahed Chakhsi              210504
8        31          31684       Abdeslam Ouaddou               33022
9        32          32637  Abdessalam Benjelloun              177295
10       34          41093           Abdou Traore              187048
11       35         564712              Abdoul Ba              225050
12       39         191784           Abdoulaye Ba              204826
13       43         189181       Abdoulaye Diallo              197233
14       45          40005         Abdoulaye Faye              100329
15       47          37280        Abdoulaye Meite               41745
16       48         439366        Abdoulaye Toure              210450
17       51         419681      Abdul Aziz Tetteh              190193
18       56          31012       Abdulkader Keita              157191
19       61          24385           Abel Aguilar              177974
20       64         172875       Abel Issa Camara              208005
21       66         240556            Abel Tamata              202153
22       68          37422     Abella Perez Damia              159580
23       71         181344       Aboubacar Tandia              138675
24       76         208635        Abraham Kudemor              202600
25       79          41489          Achille Coser              163901
26       80          25571          Achille Emana              112392
27       85          26331               Adailton              158505
28       87         495841    Adalberto Penaranda              231638
29       89          68840             Adam Banas              189047
...     ...            ...                    ...                 ...
4846  11005         274787             Yvon Mvogo              206003
4847  11006         210682       Zacharie Boucher              201138
4848  11009          33076          Zak Whitbread              138155
4849  11011         208688         Zakaria Diallo              200067
4850  11018         172489           Zander Clark              204269
4851  11021         181312        Zarko Tomasevic              193690
4852  11023         115585            Zaur Sadaev              187590
4853  11025          32633     Zbigniew Malkowski              139865
4854  11026          30861         Zdenek Grygera               40988
4855  11027          36547           Zdenek Kroca              185004
4856  11028          89251        Zdenek Ondrasek              189655
4857  11030          25772     Zdravko Kuzmanovic              168650
4858  11032          34104              Ze Castro              157947
4859  11033         128047             Ze Eduardo              188001
4860  11035         306167                Ze Luis              203757
4861  11042         157284           Zeljko Brkic              195090
4862  11043          30850           Zeljko Kalac               51883
4863  11050         244953           Ziggy Gordon              223263
4864  11053         277772             Zinho Gano              204227
4865  11056          27305      Zlatan Bajramovic               31667
4866  11057          35724     Zlatan Ibrahimovic               41236
4867  11058          12574     Zlatan Ljubijankic              176103
4868  11059          39494           Zlatko Dedic              141111
4869  11060          17233          Zlatko Janjic              188405
4870  11065          39801         Zoltan Szelesi              157283
4871  11067          56929         Zoran Rendulic              188593
4872  11070         282473         Zouhair Feddal              205705
4873  11072         111182           Zsolt Laczko              164680
4874  11074          35506    Zurab Khizanishvili               47058
4875  11075          39902     Zvjezdan Misimovic              102359

                 birthday  height  weight
0     1992-02-29 00:00:00  182.88     187
1     1982-05-08 00:00:00  182.88     198
2     1993-02-19 00:00:00  190.50     181
3     1980-11-25 00:00:00  182.88     181
4     1991-04-08 00:00:00  182.88     176
5     1976-07-12 00:00:00  187.96     185
6     1984-12-05 00:00:00  182.88     172
7     1986-10-01 00:00:00  182.88     170
8     1978-11-01 00:00:00  190.50     181
9     1985-01-28 00:00:00  187.96     179
10    1988-01-17 00:00:00  180.34     174
11    1994-02-08 00:00:00  200.66     212
12    1991-01-01 00:00:00  198.12     174
13    1992-03-30 00:00:00  187.96     174
14    1978-02-26 00:00:00  187.96     218
15    1980-10-06 00:00:00  185.42     181
16    1994-03-03 00:00:00  187.96     170
17    1989-02-10 00:00:00  182.88     190
18    1981-08-06 00:00:00  182.88     172
19    1985-01-06 00:00:00  185.42     176
20    1990-01-06 00:00:00  185.42     179
21    1990-12-05 00:00:00  182.88     170
22    1982-04-15 00:00:00  187.96     174
23    1983-10-05 00:00:00  193.04     185
24    1985-02-25 00:00:00  182.88     179
25    1982-07-14 00:00:00  185.42     174
26    1982-06-05 00:00:00  180.34     170
27    1983-04-14 00:00:00  190.50     187
28    1997-05-31 00:00:00  182.88     172
29    1982-12-25 00:00:00  185.42     174
...                   ...     ...     ...
4846  1994-06-06 00:00:00  187.96     185
4847  1992-03-07 00:00:00  180.34     174
4848  1984-01-10 00:00:00  187.96     172
4849  1986-08-13 00:00:00  193.04     194
4850  1992-06-26 00:00:00  195.58     170
4851  1990-02-22 00:00:00  187.96     187
4852  1989-11-06 00:00:00  182.88     172
4853  1978-01-19 00:00:00  187.96     181
4854  1980-05-14 00:00:00  185.42     172
4855  1980-09-29 00:00:00  193.04     196
4856  1988-12-22 00:00:00  185.42     174
4857  1987-09-22 00:00:00  185.42     176
4858  1983-01-13 00:00:00  182.88     181
4859  1991-08-16 00:00:00  185.42     194
4860  1991-01-24 00:00:00  185.42     185
4861  1986-07-09 00:00:00  198.12     209
4862  1972-12-16 00:00:00  203.20     209
4863  1993-04-23 00:00:00  180.34     170
4864  1993-10-13 00:00:00  198.12     205
4865  1979-08-12 00:00:00  182.88     174
4866  1981-10-03 00:00:00  195.58     209
4867  1983-12-15 00:00:00  185.42     176
4868  1984-10-05 00:00:00  182.88     170
4869  1986-05-07 00:00:00  187.96     183
4870  1981-11-22 00:00:00  182.88     176
4871  1984-05-22 00:00:00  190.50     179
4872  1989-01-01 00:00:00  190.50     172
4873  1986-12-18 00:00:00  182.88     176
4874  1981-10-06 00:00:00  185.42     172
4875  1982-06-05 00:00:00  180.34     176

[4876 rows x 7 columns]

In [7]:
! pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /Users/am/anaconda3/lib/python3.6/site-packages (8.0.12)
Requirement already satisfied: protobuf>=3.0.0 in /Users/am/anaconda3/lib/python3.6/site-packages (from mysql-connector-python) (3.6.1)
Requirement already satisfied: six>=1.9 in /Users/am/anaconda3/lib/python3.6/site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.11.0)
Requirement already satisfied: setuptools in /Users/am/anaconda3/lib/python3.6/site-packages (from protobuf>=3.0.0->mysql-connector-python) (39.1.0)
distributed 1.21.8 requires msgpack, which is not installed.
You are using pip version 10.0.1, however version 18.0 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [2]:
import mysql.connector

In [3]:
connection = mysql.connector.connect(host="127.0.0.1",  # your host 
                    user="root",                        # username
                    password="reddel17R" )              # password

In [4]:
print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x107a69550>

In [5]:
mycursor = connection.cursor()
mycursor.execute("SHOW DATABASES")
for x in mycursor:
  print(x)

('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

In [6]:
connection = mysql.connector.connect(host="127.0.0.1",  # your host 
                    user="root",                        # username
                    password="reddel17R" ,
                    database = 'mysql')

In [7]:
mycursor = connection.cursor()
mycursor.execute("SHOW TABLES")
for x in mycursor:
  print(x)

('columns_priv',)
('component',)
('db',)
('default_roles',)
('engine_cost',)
('func',)
('general_log',)
('global_grants',)
('gtid_executed',)
('help_category',)
('help_keyword',)
('help_relation',)
('help_topic',)
('innodb_index_stats',)
('innodb_table_stats',)
('password_history',)
('plugin',)
('procs_priv',)
('proxies_priv',)
('role_edges',)
('server_cost',)
('servers',)
('slave_master_info',)
('slave_relay_log_info',)
('slave_worker_info',)
('slow_log',)
('tables_priv',)
('time_zone',)
('time_zone_leap_second',)
('time_zone_name',)
('time_zone_transition',)
('time_zone_transition_type',)
('user',)